GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_gpio.h
// Field: [21]    DIO21
//
// Set bit 21
#define GPIO_DOUTSET31_0_DIO21                                      0x00200000
#define GPIO_DOUTSET31_0_DIO21_BITN                                 21
#define GPIO_DOUTSET31_0_DIO21_M                                    0x00200000
#define GPIO_DOUTSET31_0_DIO21_S                                    21

// Field: [20]    DIO20
//
// Set bit 20
#define GPIO_DOUTSET31_0_DIO20                                      0x00100000
#define GPIO_DOUTSET31_0_DIO20_BITN                                 20
#define GPIO_DOUTSET31_0_DIO20_M                                    0x00100000
#define GPIO_DOUTSET31_0_DIO20_S                                    20

// Field: [19]    DIO19
//
// Set bit 19
#define GPIO_DOUTSET31_0_DIO19                                      0x00080000
#define GPIO_DOUTSET31_0_DIO19_BITN                                 19
#define GPIO_DOUTSET31_0_DIO19_M                                    0x00080000
#define GPIO_DOUTSET31_0_DIO19_S                                    19

// Field: [18]    DIO18
//
// Set bit 18
#define GPIO_DOUTSET31_0_DIO18                                      0x00040000
#define GPIO_DOUTSET31_0_DIO18_BITN                                 18
#define GPIO_DOUTSET31_0_DIO18_M                                    0x00040000
#define GPIO_DOUTSET31_0_DIO18_S                                    18

// Field: [17]    DIO17
//
// Set bit 17
#define GPIO_DOUTSET31_0_DIO17                                      0x00020000
#define GPIO_DOUTSET31_0_DIO17_BITN                                 17
#define GPIO_DOUTSET31_0_DIO17_M                                    0x00020000
#define GPIO_DOUTSET31_0_DIO17_S                                    17

// Field: [16]    DIO16
//
// Set bit 16
#define GPIO_DOUTSET31_0_DIO16                                      0x00010000
#define GPIO_DOUTSET31_0_DIO16_BITN                                 16
#define GPIO_DOUTSET31_0_DIO16_M                                    0x00010000
#define GPIO_DOUTSET31_0_DIO16_S                                    16

// Field: [15]    DIO15
//
// Set bit 15
#define GPIO_DOUTSET31_0_DIO15                                      0x00008000
#define GPIO_DOUTSET31_0_DIO15_BITN                                 15
#define GPIO_DOUTSET31_0_DIO15_M                                    0x00008000
#define GPIO_DOUTSET31_0_DIO15_S                                    15

// Field: [14]    DIO14
//
// Set bit 14
#define GPIO_DOUTSET31_0_DIO14                                      0x00004000
#define GPIO_DOUTSET31_0_DIO14_BITN                                 14
#define GPIO_DOUTSET31_0_DIO14_M                                    0x00004000
#define GPIO_DOUTSET31_0_DIO14_S                                    14

// Field: [13]    DIO13
//
// Set bit 13
#define GPIO_DOUTSET31_0_DIO13                                      0x00002000
#define GPIO_DOUTSET31_0_DIO13_BITN                                 13
#define GPIO_DOUTSET31_0_DIO13_M                                    0x00002000
#define GPIO_DOUTSET31_0_DIO13_S                                    13

// Field: [12]    DIO12
//
// Set bit 12
#define GPIO_DOUTSET31_0_DIO12                                      0x00001000
#define GPIO_DOUTSET31_0_DIO12_BITN                                 12
#define GPIO_DOUTSET31_0_DIO12_M                                    0x00001000
#define GPIO_DOUTSET31_0_DIO12_S                                    12

// Field: [11]    DIO11
//
// Set bit 11
#define GPIO_DOUTSET31_0_DIO11                                      0x00000800
#define GPIO_DOUTSET31_0_DIO11_BITN                                 11
#define GPIO_DOUTSET31_0_DIO11_M                                    0x00000800
#define GPIO_DOUTSET31_0_DIO11_S                                    11

// Field: [10]    DIO10
//
// Set bit 10
#define GPIO_DOUTSET31_0_DIO10                                      0x00000400
#define GPIO_DOUTSET31_0_DIO10_BITN                                 10
#define GPIO_DOUTSET31_0_DIO10_M                                    0x00000400
#define GPIO_DOUTSET31_0_DIO10_S                                    10

// Field: [9]    DIO9
//
// Set bit 9
#define GPIO_DOUTSET31_0_DIO9                                       0x00000200
#define GPIO_DOUTSET31_0_DIO9_BITN                                  9
#define GPIO_DOUTSET31_0_DIO9_M                                     0x00000200
#define GPIO_DOUTSET31_0_DIO9_S                                     9

// Field: [8]    DIO8
//
// Set bit 8
#define GPIO_DOUTSET31_0_DIO8                                       0x00000100
#define GPIO_DOUTSET31_0_DIO8_BITN                                  8
#define GPIO_DOUTSET31_0_DIO8_M                                     0x00000100
#define GPIO_DOUTSET31_0_DIO8_S                                     8

// Field: [7]    DIO7
//
// Set bit 7
#define GPIO_DOUTSET31_0_DIO7                                       0x00000080
#define GPIO_DOUTSET31_0_DIO7_BITN                                  7
#define GPIO_DOUTSET31_0_DIO7_M                                     0x00000080
#define GPIO_DOUTSET31_0_DIO7_S                                     7

// Field: [6]    DIO6
//
// Set bit 6
#define GPIO_DOUTSET31_0_DIO6                                       0x00000040
#define GPIO_DOUTSET31_0_DIO6_BITN                                  6
#define GPIO_DOUTSET31_0_DIO6_M                                     0x00000040
#define GPIO_DOUTSET31_0_DIO6_S                                     6

// Field: [5]    DIO5
//
// Set bit 5
#define GPIO_DOUTSET31_0_DIO5                                       0x00000020
#define GPIO_DOUTSET31_0_DIO5_BITN                                  5
#define GPIO_DOUTSET31_0_DIO5_M                                     0x00000020
#define GPIO_DOUTSET31_0_DIO5_S                                     5

// Field: [4]    DIO4
//
// Set bit 4
#define GPIO_DOUTSET31_0_DIO4                                       0x00000010
#define GPIO_DOUTSET31_0_DIO4_BITN                                  4
#define GPIO_DOUTSET31_0_DIO4_M                                     0x00000010
#define GPIO_DOUTSET31_0_DIO4_S                                     4

// Field: [3]    DIO3
//
// Set bit 3
#define GPIO_DOUTSET31_0_DIO3                                       0x00000008
#define GPIO_DOUTSET31_0_DIO3_BITN                                  3
#define GPIO_DOUTSET31_0_DIO3_M                                     0x00000008
#define GPIO_DOUTSET31_0_DIO3_S                                     3

// Field: [2]    DIO2
//
// Set bit 2
#define GPIO_DOUTSET31_0_DIO2                                       0x00000004
#define GPIO_DOUTSET31_0_DIO2_BITN                                  2
#define GPIO_DOUTSET31_0_DIO2_M                                     0x00000004
#define GPIO_DOUTSET31_0_DIO2_S                                     2

// Field: [1]    DIO1
//
// Set bit 1
#define GPIO_DOUTSET31_0_DIO1                                       0x00000002
#define GPIO_DOUTSET31_0_DIO1_BITN                                  1
#define GPIO_DOUTSET31_0_DIO1_M                                     0x00000002
#define GPIO_DOUTSET31_0_DIO1_S                                     1

// Field: [0]    DIO0
//
// Set bit 0
#define GPIO_DOUTSET31_0_DIO0                                       0x00000001
#define GPIO_DOUTSET31_0_DIO0_BITN                                  0
#define GPIO_DOUTSET31_0_DIO0_M                                     0x00000001
#define GPIO_DOUTSET31_0_DIO0_S                                     0

//*****************************************************************************
//
// Register: GPIO_O_DOUTCLR31_0
//
//*****************************************************************************
// Field: [31]    DIO31
//
// Clears bit 31
#define GPIO_DOUTCLR31_0_DIO31                                      0x80000000
#define GPIO_DOUTCLR31_0_DIO31_BITN                                 31
#define GPIO_DOUTCLR31_0_DIO31_M                                    0x80000000
#define GPIO_DOUTCLR31_0_DIO31_S                                    31

