GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_gpio.h
// Field: [30]    DIO30
//
// Clears bit 30
#define GPIO_DOUTCLR31_0_DIO30                                      0x40000000
#define GPIO_DOUTCLR31_0_DIO30_BITN                                 30
#define GPIO_DOUTCLR31_0_DIO30_M                                    0x40000000
#define GPIO_DOUTCLR31_0_DIO30_S                                    30

// Field: [29]    DIO29
//
// Clears bit 29
#define GPIO_DOUTCLR31_0_DIO29                                      0x20000000
#define GPIO_DOUTCLR31_0_DIO29_BITN                                 29
#define GPIO_DOUTCLR31_0_DIO29_M                                    0x20000000
#define GPIO_DOUTCLR31_0_DIO29_S                                    29

// Field: [28]    DIO28
//
// Clears bit 28
#define GPIO_DOUTCLR31_0_DIO28                                      0x10000000
#define GPIO_DOUTCLR31_0_DIO28_BITN                                 28
#define GPIO_DOUTCLR31_0_DIO28_M                                    0x10000000
#define GPIO_DOUTCLR31_0_DIO28_S                                    28

// Field: [27]    DIO27
//
// Clears bit 27
#define GPIO_DOUTCLR31_0_DIO27                                      0x08000000
#define GPIO_DOUTCLR31_0_DIO27_BITN                                 27
#define GPIO_DOUTCLR31_0_DIO27_M                                    0x08000000
#define GPIO_DOUTCLR31_0_DIO27_S                                    27

// Field: [26]    DIO26
//
// Clears bit 26
#define GPIO_DOUTCLR31_0_DIO26                                      0x04000000
#define GPIO_DOUTCLR31_0_DIO26_BITN                                 26
#define GPIO_DOUTCLR31_0_DIO26_M                                    0x04000000
#define GPIO_DOUTCLR31_0_DIO26_S                                    26

// Field: [25]    DIO25
//
// Clears bit 25
#define GPIO_DOUTCLR31_0_DIO25                                      0x02000000
#define GPIO_DOUTCLR31_0_DIO25_BITN                                 25
#define GPIO_DOUTCLR31_0_DIO25_M                                    0x02000000
#define GPIO_DOUTCLR31_0_DIO25_S                                    25

// Field: [24]    DIO24
//
// Clears bit 24
#define GPIO_DOUTCLR31_0_DIO24                                      0x01000000
#define GPIO_DOUTCLR31_0_DIO24_BITN                                 24
#define GPIO_DOUTCLR31_0_DIO24_M                                    0x01000000
#define GPIO_DOUTCLR31_0_DIO24_S                                    24

// Field: [23]    DIO23
//
// Clears bit 23
#define GPIO_DOUTCLR31_0_DIO23                                      0x00800000
#define GPIO_DOUTCLR31_0_DIO23_BITN                                 23
#define GPIO_DOUTCLR31_0_DIO23_M                                    0x00800000
#define GPIO_DOUTCLR31_0_DIO23_S                                    23

// Field: [22]    DIO22
//
// Clears bit 22
#define GPIO_DOUTCLR31_0_DIO22                                      0x00400000
#define GPIO_DOUTCLR31_0_DIO22_BITN                                 22
#define GPIO_DOUTCLR31_0_DIO22_M                                    0x00400000
#define GPIO_DOUTCLR31_0_DIO22_S                                    22

// Field: [21]    DIO21
//
// Clears bit 21
#define GPIO_DOUTCLR31_0_DIO21                                      0x00200000
#define GPIO_DOUTCLR31_0_DIO21_BITN                                 21
#define GPIO_DOUTCLR31_0_DIO21_M                                    0x00200000
#define GPIO_DOUTCLR31_0_DIO21_S                                    21

// Field: [20]    DIO20
//
// Clears bit 20
#define GPIO_DOUTCLR31_0_DIO20                                      0x00100000
#define GPIO_DOUTCLR31_0_DIO20_BITN                                 20
#define GPIO_DOUTCLR31_0_DIO20_M                                    0x00100000
#define GPIO_DOUTCLR31_0_DIO20_S                                    20

// Field: [19]    DIO19
//
// Clears bit 19
#define GPIO_DOUTCLR31_0_DIO19                                      0x00080000
#define GPIO_DOUTCLR31_0_DIO19_BITN                                 19
#define GPIO_DOUTCLR31_0_DIO19_M                                    0x00080000
#define GPIO_DOUTCLR31_0_DIO19_S                                    19

// Field: [18]    DIO18
//
// Clears bit 18
#define GPIO_DOUTCLR31_0_DIO18                                      0x00040000
#define GPIO_DOUTCLR31_0_DIO18_BITN                                 18
#define GPIO_DOUTCLR31_0_DIO18_M                                    0x00040000
#define GPIO_DOUTCLR31_0_DIO18_S                                    18

// Field: [17]    DIO17
//
// Clears bit 17
#define GPIO_DOUTCLR31_0_DIO17                                      0x00020000
#define GPIO_DOUTCLR31_0_DIO17_BITN                                 17
#define GPIO_DOUTCLR31_0_DIO17_M                                    0x00020000
#define GPIO_DOUTCLR31_0_DIO17_S                                    17

// Field: [16]    DIO16
//
// Clears bit 16
#define GPIO_DOUTCLR31_0_DIO16                                      0x00010000
#define GPIO_DOUTCLR31_0_DIO16_BITN                                 16
#define GPIO_DOUTCLR31_0_DIO16_M                                    0x00010000
#define GPIO_DOUTCLR31_0_DIO16_S                                    16

// Field: [15]    DIO15
//
// Clears bit 15
#define GPIO_DOUTCLR31_0_DIO15                                      0x00008000
#define GPIO_DOUTCLR31_0_DIO15_BITN                                 15
#define GPIO_DOUTCLR31_0_DIO15_M                                    0x00008000
#define GPIO_DOUTCLR31_0_DIO15_S                                    15

// Field: [14]    DIO14
//
// Clears bit 14
#define GPIO_DOUTCLR31_0_DIO14                                      0x00004000
#define GPIO_DOUTCLR31_0_DIO14_BITN                                 14
#define GPIO_DOUTCLR31_0_DIO14_M                                    0x00004000
#define GPIO_DOUTCLR31_0_DIO14_S                                    14

// Field: [13]    DIO13
//
// Clears bit 13
#define GPIO_DOUTCLR31_0_DIO13                                      0x00002000
#define GPIO_DOUTCLR31_0_DIO13_BITN                                 13
#define GPIO_DOUTCLR31_0_DIO13_M                                    0x00002000
#define GPIO_DOUTCLR31_0_DIO13_S                                    13

