GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_gpio.h
// Field: [26]    DIO26
//
// Toggles bit 26
#define GPIO_DOUTTGL31_0_DIO26                                      0x04000000
#define GPIO_DOUTTGL31_0_DIO26_BITN                                 26
#define GPIO_DOUTTGL31_0_DIO26_M                                    0x04000000
#define GPIO_DOUTTGL31_0_DIO26_S                                    26

// Field: [25]    DIO25
//
// Toggles bit 25
#define GPIO_DOUTTGL31_0_DIO25                                      0x02000000
#define GPIO_DOUTTGL31_0_DIO25_BITN                                 25
#define GPIO_DOUTTGL31_0_DIO25_M                                    0x02000000
#define GPIO_DOUTTGL31_0_DIO25_S                                    25

// Field: [24]    DIO24
//
// Toggles bit 24
#define GPIO_DOUTTGL31_0_DIO24                                      0x01000000
#define GPIO_DOUTTGL31_0_DIO24_BITN                                 24
#define GPIO_DOUTTGL31_0_DIO24_M                                    0x01000000
#define GPIO_DOUTTGL31_0_DIO24_S                                    24

// Field: [23]    DIO23
//
// Toggles bit 23
#define GPIO_DOUTTGL31_0_DIO23                                      0x00800000
#define GPIO_DOUTTGL31_0_DIO23_BITN                                 23
#define GPIO_DOUTTGL31_0_DIO23_M                                    0x00800000
#define GPIO_DOUTTGL31_0_DIO23_S                                    23

// Field: [22]    DIO22
//
// Toggles bit 22
#define GPIO_DOUTTGL31_0_DIO22                                      0x00400000
#define GPIO_DOUTTGL31_0_DIO22_BITN                                 22
#define GPIO_DOUTTGL31_0_DIO22_M                                    0x00400000
#define GPIO_DOUTTGL31_0_DIO22_S                                    22

// Field: [21]    DIO21
//
// Toggles bit 21
#define GPIO_DOUTTGL31_0_DIO21                                      0x00200000
#define GPIO_DOUTTGL31_0_DIO21_BITN                                 21
#define GPIO_DOUTTGL31_0_DIO21_M                                    0x00200000
#define GPIO_DOUTTGL31_0_DIO21_S                                    21

// Field: [20]    DIO20
//
// Toggles bit 20
#define GPIO_DOUTTGL31_0_DIO20                                      0x00100000
#define GPIO_DOUTTGL31_0_DIO20_BITN                                 20
#define GPIO_DOUTTGL31_0_DIO20_M                                    0x00100000
#define GPIO_DOUTTGL31_0_DIO20_S                                    20

// Field: [19]    DIO19
//
// Toggles bit 19
#define GPIO_DOUTTGL31_0_DIO19                                      0x00080000
#define GPIO_DOUTTGL31_0_DIO19_BITN                                 19
#define GPIO_DOUTTGL31_0_DIO19_M                                    0x00080000
#define GPIO_DOUTTGL31_0_DIO19_S                                    19

// Field: [18]    DIO18
//
// Toggles bit 18
#define GPIO_DOUTTGL31_0_DIO18                                      0x00040000
#define GPIO_DOUTTGL31_0_DIO18_BITN                                 18
#define GPIO_DOUTTGL31_0_DIO18_M                                    0x00040000
#define GPIO_DOUTTGL31_0_DIO18_S                                    18

// Field: [17]    DIO17
//
// Toggles bit 17
#define GPIO_DOUTTGL31_0_DIO17                                      0x00020000
#define GPIO_DOUTTGL31_0_DIO17_BITN                                 17
#define GPIO_DOUTTGL31_0_DIO17_M                                    0x00020000
#define GPIO_DOUTTGL31_0_DIO17_S                                    17

// Field: [16]    DIO16
//
// Toggles bit 16
#define GPIO_DOUTTGL31_0_DIO16                                      0x00010000
#define GPIO_DOUTTGL31_0_DIO16_BITN                                 16
#define GPIO_DOUTTGL31_0_DIO16_M                                    0x00010000
#define GPIO_DOUTTGL31_0_DIO16_S                                    16

// Field: [15]    DIO15
//
// Toggles bit 15
#define GPIO_DOUTTGL31_0_DIO15                                      0x00008000
#define GPIO_DOUTTGL31_0_DIO15_BITN                                 15
#define GPIO_DOUTTGL31_0_DIO15_M                                    0x00008000
#define GPIO_DOUTTGL31_0_DIO15_S                                    15

// Field: [14]    DIO14
//
// Toggles bit 14
#define GPIO_DOUTTGL31_0_DIO14                                      0x00004000
#define GPIO_DOUTTGL31_0_DIO14_BITN                                 14
#define GPIO_DOUTTGL31_0_DIO14_M                                    0x00004000
#define GPIO_DOUTTGL31_0_DIO14_S                                    14

// Field: [13]    DIO13
//
// Toggles bit 13
#define GPIO_DOUTTGL31_0_DIO13                                      0x00002000
#define GPIO_DOUTTGL31_0_DIO13_BITN                                 13
#define GPIO_DOUTTGL31_0_DIO13_M                                    0x00002000
#define GPIO_DOUTTGL31_0_DIO13_S                                    13

// Field: [12]    DIO12
//
// Toggles bit 12
#define GPIO_DOUTTGL31_0_DIO12                                      0x00001000
#define GPIO_DOUTTGL31_0_DIO12_BITN                                 12
#define GPIO_DOUTTGL31_0_DIO12_M                                    0x00001000
#define GPIO_DOUTTGL31_0_DIO12_S                                    12

// Field: [11]    DIO11
//
// Toggles bit 11
#define GPIO_DOUTTGL31_0_DIO11                                      0x00000800
#define GPIO_DOUTTGL31_0_DIO11_BITN                                 11
#define GPIO_DOUTTGL31_0_DIO11_M                                    0x00000800
#define GPIO_DOUTTGL31_0_DIO11_S                                    11

// Field: [10]    DIO10
//
// Toggles bit 10
#define GPIO_DOUTTGL31_0_DIO10                                      0x00000400
#define GPIO_DOUTTGL31_0_DIO10_BITN                                 10
#define GPIO_DOUTTGL31_0_DIO10_M                                    0x00000400
#define GPIO_DOUTTGL31_0_DIO10_S                                    10

